{"meta":{"title":"Tasos Bitsios - Software Engineer - Resumee","description":"Tasos Bitsios personal website","keywords":"tasos bitsios, cv, curriculum, developer, php, mysql"},

"title":"Tasos Bitsios","subtitle":"Full Stack Web Engineer",

"footer":"© 2013 Tasos Bitsios. All rights reserved.",

"sections":[

	{"title":"Profile","type":"text","content":[
		"I have had a passion for technology since before I can remember myself. I am told that my first programming assignment was at age 5, when I successfully scheduled a VCR to record something for my Grandparents. Since then, I have been infatuated with our ability to create things online with minimal cost, accessible by millions of people. I am particularly interested in <b>scalability</b> and <b>security</b>. I am currently starting-up my project, YouRad.io, into a company."
	]},

	{"title":"Personal Details","type":"personal","content":[
		{"Name":"Tasos Bitsios"},
		{"Nationality":"Greek"},
		{"Phone":"+44 7906 69 18 09"},
		{"Email":"tasinet@tasinet.com"},
		{"Spoken Languages":"<span class=\"float-left\">English - Excellent<br>Greek - Excellent<br/>German - Somewhat</span>"}
	]},
	
	{"title":"Work Experience","type":"timeline","content":[
		{"title":"Software Engineer","subtitle":"GREE UK, Ltd, Full-Time","time":"2012 - 2013","content":[
			"GREE is a Japanese social gaming giant. I worked in its UK studio during its infancy, as a backend and frontend software engineer. We worked with a proprietary PHP framework and sharded SQL database solution, Gearman, MongoDB for analytics, Vagrant for VM management and Cordova/HTML5 on the frontend. I contributed a forked version of our PHP framework with 20~30% reduced function calls (on average), automatically generated client-server contracts (DTOs) and designed a NoSQL analytics/reporting backend."
		]},
		{"title":"Software Engineer","subtitle":"Fanatix Ltd, Full-Time","time":"2010 - 2012","content":[
			"Core developer. Involved from day one, I designed, developed, administered and maintained the Fanatix backend alongside CTO Peter Bevan.",
			{"type":"list","content":[
				"NoSQL data design, optimisation for scalability, administration (sharded MongoDB).",
				"Worked with PHPTAL, jQuery Templates, Web Sockets, Protocol Buffers, third party APIs.",
				"Facebook integration: Data import, social plugins, data export (Open Graph actions).",
				"Designed & Developed the Fanatix REST API (\"FREST\"), which powers the mobile clients (iPhone, iPad).",
				"Mentored a graduate developer for two months."
			]}
		]}
	]},

	{"title":"Projects","type":"timeline","content":[
		{"title":"YouRad.io","subtitle":"http://yourad.io","time":"2011 - present","content":[
			"I started YouRad.io as a personal project in October 2011. I developed this \"Social Media Player\" to aggregate media links from social accounts (Facebook) for consumption. Recognises Youtube, Soundcloud and Vimeo links. It uses a heuristic algorithm to decide \"music/not music\" (and separate the two) and offers \"star\", \"tag\", \"like\" and \"comment\" functionality. The app-like interface, written in Javascript, allows for navigation without interrupting the embedded player. Front-end styled with Bootstrap (by Twitter). Served from nginx and MongoDB, hosted on Amazon EC2. <b>Currently seeking funding.</b>"
		]},
		{"title":"Twitter Trend Viewer","subtitle":"http://www.twittertrendviewer.com","time":"2012","content":[
			"Real-time viewer of trending topic tweets. Node.js/Twitter streaming API/websockets. (unstyled)"
		]},
		{"title":"Derpback","subtitle":"http://www.derpback.com","time":"2012","content":[
			"A feedback-collecting service. Built with Rails. Hosted on Heroku."
		]}
	]},

	{"title":"Technical Skills","type":"list","content":[
		{"title":"Programming Languages","content":["PHP, Javascript, node.js, Bash, Python, Ruby, Clojure, Java, C, Objective C, Brainf*ck"]},
		{"title":"Data Stores","content":["MongoDB, (My)SQL, Memcache, Redis, SQLite3"]},
		{"title":"Frameworks","content":["(PHP) CodeIgniter, Kohana 3, (JS) Angular, jQuery/UI/Mobile, PhoneGap/Cordova, Backbone (Ruby) Rails  (other) Bootstrap, Gearman"]},
		{"title":"Platforms","content":["Linux, Mac OS X, Windows, Virtualized Environments (Vagrant/Chef, AWS, Rackspace, Heroku), iOS, Android"]},
		{"title":"APIs","content":["Facebook Graph/FQL, Twitter, Google Analytics/Adsense/Data, YouTube, Soundcloud, Vimeo"]},
		{"title":"Other Stuff","content":[
			{"type":"list","content":[
				"Data modelling, Relational & NoSQL database design",
				"Agile Development, Test Driven Development",
				"Administration: Linux, Apache, nginx, lighttpd, MySQL, MongoDB",
				"HTML, CSS, DOM, XML, JSON, Protocol Buffers",
				"Search Engine Optimization principles"
			]}
		]}
	]},

	{"title":"Education","type":"timeline","content":[
		{"title":"MSc Information Security","subtitle":"UCL (University College London)","time":"2006 - 2007","content":[
			"Master’s Thesis: Anti-Phishing based on Content Correlation. Research in Phishing and anti-Phishing techniques; development of a functioning content-correlating crawler which provides anti-Phishing protection by comparing page content with an index of white-listed sites, that are not to be imitated. Proof of concept code in PHP, demo client plug-in for Mozilla Firefox."
		]},
		{"title":"BSc Computer Science","subtitle":"University of Warwick","time":"2003 - 2006","content":[
			"Final year project: I developed a prototype PGP-secured Instant Messaging service in Java"
		]},
		{"title":"International Baccalaureate","subtitle":"Moraitis International Baccalaureate School","time":"2001 - 2003","content":[
			"High Level: Math, Physics, Greek. Standard Level: English, Economics, Computer Science."
		]}
	]}

]}
